VDowbensky/HC32/L13x_L15x/HC32L130_SDK_121018/HC32L130_IDE_Rev1.0.0/IAR_IDE/config/debugger/HDSC/HC32L130E8PA.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>GPIO</name>
            <description>desc GPIO</description>
            <baseAddress>0x40020C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x800</size>
            </addressBlock>
            <registers>
                <register>
                    <name>PA00_SEL</name>
                    <description>desc PA00_SEL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA01_SEL</name>
                    <description>desc PA01_SEL</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA02_SEL</name>
                    <description>desc PA02_SEL</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA03_SEL</name>
                    <description>desc PA03_SEL</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA04_SEL</name>
                    <description>desc PA04_SEL</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA05_SEL</name>
                    <description>desc PA05_SEL</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA06_SEL</name>
                    <description>desc PA06_SEL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA07_SEL</name>
                    <description>desc PA07_SEL</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA08_SEL</name>
                    <description>desc PA08_SEL</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA09_SEL</name>
                    <description>desc PA09_SEL</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA10_SEL</name>
                    <description>desc PA10_SEL</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA11_SEL</name>
                    <description>desc PA11_SEL</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA12_SEL</name>
                    <description>desc PA12_SEL</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA13_SEL</name>
                    <description>desc PA13_SEL</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PA14_SEL</name>
                    <description>desc PA14_SEL</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PB00_SEL</name>
                    <description>desc PB00_SEL</description>
                    <addressOffset>0x40</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PB01_SEL</name>
                    <description>desc PB01_SEL</description>
                    <addressOffset>0x44</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PB02_SEL</name>
                    <description>desc PB02_SEL</description>
                    <addressOffset>0x48</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PC14_SEL</name>
                    <description>desc PC14_SEL</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PC15_SEL</name>
                    <description>desc PC15_SEL</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PD00_SEL</name>
                    <description>desc PD00_SEL</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PD01_SEL</name>
                    <description>desc PD01_SEL</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PD03_SEL</name>
                    <description>desc PD03_SEL</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>SEL</name>
                            <description>desc SEL</description>
                            <msb>2</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PADIR</name>
                    <description>desc PADIR</description>
                    <addressOffset>0x100</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PA00</name>
                            <description>desc PA00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA01</name>
                            <description>desc PA01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA02</name>
                            <description>desc PA02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA03</name>
                            <description>desc PA03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA04</name>
                            <description>desc PA04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA05</name>
                            <description>desc PA05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA06</name>
                            <description>desc PA06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA07</name>
                            <description>desc PA07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA08</name>
                            <description>desc PA08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA09</name>
                            <description>desc PA09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA10</name>
                            <description>desc PA10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA11</name>
                            <description>desc PA11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA12</name>
                            <description>desc PA12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA13</name>
                            <description>desc PA13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PA14</name>
                            <description>desc PA14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
