VDowbensky/HC32/L13x_L15x/HC32L130_SDK_121018/HC32L130_IDE_Rev1.0.0/IAR_IDE/config/debugger/HDSC/HC32L130E8PA.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>TIM3_MODE0</name>
            <description>desc TIM3_MODE0</description>
            <baseAddress>0x40005800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x34</size>
            </addressBlock>
            <registers>
                <register>
                    <name>ARR</name>
                    <description>desc ARR</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>ARR</name>
                            <description>desc ARR</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNT</name>
                    <description>desc CNT</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>desc CNT</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNT32</name>
                    <description>desc CNT32</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CNT32</name>
                            <description>desc CNT32</description>
                            <msb>31</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>M0CR</name>
                    <description>desc M0CR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x600008</resetValue>
                    <resetMask>0x377F</resetMask>
                    <fields>
                        <field>
                            <name>CTEN</name>
                            <description>desc CTEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MD</name>
                            <description>desc MD</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CT</name>
                            <description>desc CT</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TOGEN</name>
                            <description>desc TOGEN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PRS</name>
                            <description>desc PRS</description>
                            <msb>6</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GATE</name>
                            <description>desc GATE</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GATEP</name>
                            <description>desc GATEP</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UIE</name>
                            <description>desc UIE</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IFR</name>
                    <description>desc IFR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>UIF</name>
                            <description>desc UIF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICLR</name>
                    <description>desc ICLR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0xFFFF</resetValue>
                    <resetMask>0x1</resetMask>
                    <fields>
                        <field>
                            <name>UIF</name>
                            <description>desc UIF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTR</name>
                    <description>desc DTR</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1000</resetMask>
                    <fields>
                        <field>
                            <name>MOE</name>
                            <description>desc MOE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
