VDowbensky/HC32/L13x_L15x/HC32L130_SDK_121018/HC32L130_IDE_Rev1.0.0/IAR_IDE/config/debugger/HDSC/HC32L130E8PA.svd
                <register>
                    <name>DCONR</name>
                    <description>desc DCONR</description>
                    <addressOffset>0x60</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x101</resetMask>
                    <fields>
                        <field>
                            <name>DTCEN</name>
                            <description>desc DTCEN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEPA</name>
                            <description>desc SEPA</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCONR</name>
                    <description>desc FCONR</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x77770077</resetMask>
                    <fields>
                        <field>
                            <name>NOFIENGA</name>
                            <description>desc NOFIENGA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKGA</name>
                            <description>desc NOFICKGA</description>
                            <msb>2</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENGB</name>
                            <description>desc NOFIENGB</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKGB</name>
                            <description>desc NOFICKGB</description>
                            <msb>6</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTA</name>
                            <description>desc NOFIENTA</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTA</name>
                            <description>desc NOFICKTA</description>
                            <msb>18</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTB</name>
                            <description>desc NOFIENTB</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTB</name>
                            <description>desc NOFICKTB</description>
                            <msb>22</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTC</name>
                            <description>desc NOFIENTC</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTC</name>
                            <description>desc NOFICKTC</description>
                            <msb>26</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFIENTD</name>
                            <description>desc NOFIENTD</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOFICKTD</name>
                            <description>desc NOFICKTD</description>
                            <msb>30</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VPERR</name>
                    <description>desc VPERR</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x1F000F</resetMask>
                    <fields>
                        <field>
                            <name>GEPERIA</name>
                            <description>desc GEPERIA</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GEPERIB</name>
                            <description>desc GEPERIB</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GEPERIC</name>
                            <description>desc GEPERIC</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GEPERID</name>
                            <description>desc GEPERID</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCNTE</name>
                            <description>desc PCNTE</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCNTS</name>
                            <description>desc PCNTS</description>
                            <msb>20</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STFLR</name>
                    <description>desc STFLR</description>
                    <addressOffset>0x70</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x81C01FCF</resetMask>
                    <fields>
                        <field>
                            <name>CMAF</name>
                            <description>desc CMAF</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMBF</name>
                            <description>desc CMBF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMCF</name>
                            <description>desc CMCF</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMDF</name>
                            <description>desc CMDF</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OVFF</name>
                            <description>desc OVFF</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UDFF</name>
                            <description>desc UDFF</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DTEF</name>
                            <description>desc DTEF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSAUF</name>
                            <description>desc CMSAUF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSADF</name>
                            <description>desc CMSADF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSBUF</name>
                            <description>desc CMSBUF</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMSBDF</name>
                            <description>desc CMSBDF</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VPERNUM</name>
                            <description>desc VPERNUM</description>
                            <msb>23</msb>
                            <lsb>21</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DIRF</name>
                            <description>desc DIRF</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSTAR</name>
                    <description>desc HSTAR</description>
                    <addressOffset>0x74</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x8000FFFF</resetMask>
                    <fields>
                        <field>
                            <name>HSTA0</name>
                            <description>desc HSTA0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA1</name>
                            <description>desc HSTA1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA2</name>
                            <description>desc HSTA2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA3</name>
                            <description>desc HSTA3</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA4</name>
                            <description>desc HSTA4</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA5</name>
                            <description>desc HSTA5</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA6</name>
                            <description>desc HSTA6</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA7</name>
                            <description>desc HSTA7</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA8</name>
                            <description>desc HSTA8</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA9</name>
                            <description>desc HSTA9</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA10</name>
                            <description>desc HSTA10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA11</name>
                            <description>desc HSTA11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA12</name>
                            <description>desc HSTA12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA13</name>
                            <description>desc HSTA13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA14</name>
                            <description>desc HSTA14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSTA15</name>
                            <description>desc HSTA15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STARTS</name>
                            <description>desc STARTS</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
